# Пользователь вводит с клавиатуры число. Требуется посчитать факториал яисла.
# n!=1*....*(n-2)*(n-1)*n
n=int(input("n= "))
f=1
while n>1:
    f=f*n
    n-=1
print(f)