# Пользователь вводит с клавиатуры длину линии.нужно отобразить на экране горизонтальную линию....
# l-длина линии. s-символ для заполнения линии.
l=int(input("l= "))
s= ("*")
for i in range(1):
    print(("*")*l)
    
    
