# Пользователь вводит с клавиатуры длину линии и символ для заполнения линии....
# l-длина линии. s-символ для заполнения линии.
l=int(input("l= "))
s=(input(""))
# i=0
# if l>0:
    # l=+1
for i in range(0, l):
        print(s, end=" ")
        

    

