# Написать программу, которая по выбору пользователя возводит выбранное число в степень от нулевой до седьмой включительно.
a=int(input("number: "))
print("vubor")
print("1: a**0")
print("2: a**1")
print("3: a**2")
print("4: a**3")
print("5: a**4")
print("6: a**5")
print("7: a**6")
print("8: a**7")
choise=int(input("vas vybor"))
if choise==1:
    print(a**0)
if choise==2:
    print(a**1)
if choise==3:
    print(a**2)
if choise==4:
    print(a**3)
if choise==5:
    print(a**4)
if choise==6:
    print(a**5)
if choise==7:
    print(a**6)
if choise==8:
    print(a**7)