# Пользователь вводит с клавиатуры размер стороны квадрата. Требуется отобразить на экран заполненный
n=int(input("Введите размер стороны квадрата"))
for i in range(n):
    print("*" * n)