# Пользователь вводит с клавиатуры ширину и высоту прямоугольника.
n=int(input("Введите ширину прямоугольника"))
h=int(input("Введите высоту прямоугольника"))
for i in range(h):
    print("*" * n)