# Пользователь вводит с клавиатуры два числа. Необходимо показать максимум из двух чисел и вывести его на экран.
a=float(input("input number: "))
b=float(input("input number: "))
if a>b:
    print(a)
else: 
    print(b)
