# Пользователь вводит с клавиатуры число. Необходимо проверить его на кратность 7....
a=int(input("input number: "))
if a%7==0:
    print("number is myltiple 7")
else:
    print("number is not multiple 7.")