# Пользователь вводит с клавиатуры число. Необходимо проверить его на четность и нечетность...
a=int(input("input number: "))
if a%2==0:
    print("even number")
else:
    print("odd number")
    
