# Пользователь вводит с клавиатуры время в секундах, прошедшее с начала дня. В зависимости от вібора пользователя посчитать.....
day=second=24*60*60
x=int(input("x: "))
if (0<=x<=86400):
    a=86400-x
    b=1440-x//60
    c=24-x//60//60
    print(a)
    print(b)
    print(c)
else:
    print("no")
